|                                                                                                                    | Points | Cote | Total | Commentaires                                                                                                                                                                        |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Programmation correcte des fonctionnalités de l’application                                                        |        |      |       |                                                                                                                                                                                     |   |
| + Architecture modulaire facilitant la réutilisation et les tests (architecture épurée)                            |        |      |       |                                                                                                                                                                                     |   |
| -- dépendances univoques                                                                                           |     20 | A    |  20.0 |                                                                                                                                                                                     |   |
| -- utilisation d'abstractions pour inverser les dépendances                                                        |     20 | A    |  20.0 |                                                                                                                                                                                     |   |
| + Séparation correcte des responsabilités                                                                          |        |      |       |                                                                                                                                                                                     |   |
| -- couche de présentation (MVP)                                                                                    |     10 | B    |   8.0 | Ne rattrapez jamais les Exception «catch (Exception e)»! Vous ne faites que cacher des bogues. La prise de photos est faite dans la vue; c'est plutôt une tâche pour le présenteur. |   |
| -- couche de traitement (domaine, entités, interacteurs)                                                           |     10 | A    |  10.0 |                                                                                                                                                                                     |   |
| -- couche d'accès aux données (DAOs)                                                                               |     10 | A    |  10.0 |                                                                                                                                                                                     |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Conception correcte des interfaces graphiques                                                                      |        |      |       |                                                                                                                                                                                     |   |
| + Convivialité                                                                                                     |      5 | C    |   3.0 | L'ergonomie fait un peu 1992. On dirait plus une application de bureau que mobile.                                                                                                  |   |
| + Validation des entrées                                                                                           |      5 | A    |   5.0 |                                                                                                                                                                                     |   |
| + Rétroaction                                                                                                      |      5 | B    |   4.0 | Rien ne semble indiquer le tri actuel des joueur.                                                                                                                                   |   |
| + Confirmation ou récupération des actions destructrices                                                           |        |      |       | N/A                                                                                                                                                                                 |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Programmation judicieuse des interactions avec l’utilisateur                                                       |        |      |       |                                                                                                                                                                                     |   |
| + Utilisation de fils esclaves pour toutes les opérations longues                                                  |     15 | A    |  15.0 |                                                                                                                                                                                     |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Programmation judicieuse des interactions avec l’environnement (capteurs, logiciels, données internes et externes) |        |      |       |                                                                                                                                                                                     |   |
| + Permissions                                                                                                      |        |      |       |                                                                                                                                                                                     |   |
| -- Choix des permissions demandées                                                                                 |     10 | B    |   8.0 | Pourquoi la permission RECEIVE_BOOT_COMPLETED?                                                                                                                                      |   |
| -- Gestion des requêtes de permission                                                                              |     10 | A    |  10.0 |                                                                                                                                                                                     |   |
| + Sécurité des données                                                                                             |     15 | A    |  15.0 | Pensez à passer votre API à HTTPS!                                                                                                                                                  |   |
| + Partage des données entre applications                                                                           |     30 | A    |  30.0 |                                                                                                                                                                                     |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Utilisation adéquate des mécanismes de collaboration en équipe                                                     |        |      |       |                                                                                                                                                                                     |   |
| + Carnet de produit                                                                                                |     10 | B    |   8.0 | C'est plutôt inégal                                                                                                                                                                 |   |
| + Récits utilisateurs complets                                                                                     |     10 | B    |   8.0 | Vous avez mal compris les critères d'acceptation... il ne s'agit pas de _toujours_ commencer par «étant donné un utilisateur connecté...»                                           |   |
| + Établissement des récits à effectuer pour chaque sprint                                                          |     10 | A    |  10.0 |                                                                                                                                                                                     |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Pertinence et clarté de la documentation                                                                           |        |      |       |                                                                                                                                                                                     |   |
| + Documentation du code source                                                                                     |     10 | C    |   6.0 | Ça s'est amélioré... lâchez pas!                                                                                                                                                    |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Validation judicieuse de l’application à l’aide de tests                                                           |        |      |       |                                                                                                                                                                                     |   |
| + Tests unitaires                                                                                                  |        |      |       |                                                                                                                                                                                     |   |
| -- exhaustifs, corrects et fonctionnels.                                                                           |     30 | C    |  18.0 | À moitié testé                                                                                                                                                                      |   |
| + Tests d'intégration                                                                                              |        |      |       |                                                                                                                                                                                     |   |
| -- exhaustifs, corrects et fonctionnels.                                                                           |     30 | E    |   0.0 |                                                                                                                                                                                     |   |
|--------------------------------------------------------------------------------------------------------------------+--------+------+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---|
| Total                                                                                                              |    270 |      |  208. | Portez plus attention à votre écriture. Les fautes sont partout dans votre code, même dans les noms de méthodes. Ça ne fait pas sérieux.                               |   |
#+TBLFM: @34$2=vsum(@4..@33)
#+TBLFM: @3$4..@33$4='(cond ((string= "" $3) "") ((string= "E" $3) 0.0) (t (format "%2.1f" (* (string-to-number $2) (/ (+ (- 70 (aref $3 0)) (cond ((= (aref (substring $3 -1) 0) ?+) 0.33) ((= (aref (substring $3 -1) 0) ?-) -0.33) (t 0))) 5.0)))))'
#+TBLFM: @34$4=vsum(@4..@33)
